# WEBSCRAPING

In [ ]:
#!pip install pandas
!pip install bs4
!pip install requests

## Imports

In [4]:
from bs4 import BeautifulSoup #helps in web scrapping.
import requests # helps us to download a web page
import pandas as pd
from bs4 import BeautifulSoup

## Extract Data Using Web Scraping

In [6]:
url = "https://en.wikipedia.org/wiki/List_of_largest_banks"
data = requests.get(url).text

### Scraping the Data

In [8]:
# Using BeautifulSoup parse the contents of the webpage.

soup = BeautifulSoup(data, "html.parser")

In [9]:
data = pd.DataFrame(columns=["Name", "Market Cap (US$ Billion)"])

for row in soup.find_all('tbody')[3].find_all('tr'):
    col = row.find_all('td')
    if len(col)>=2:
        data = data.append({"Name" :col[1].text, "Market Cap (US$ Billion)" :col[2].text.replace('\n','')},ignore_index=True)
data

                                          Name Market Cap (US$ Billion)
0                             JPMorgan Chase\n                  488.470
1                            Bank of America\n                  379.250
2    Industrial and Commercial Bank of China\n                  246.500
3                                Wells Fargo\n                  308.013
4                    China Construction Bank\n                  257.399
..                                         ...                      ...
65                              Ping An Bank\n                   37.993
66                        Standard Chartered\n                   37.319
67                      United Overseas Bank\n                   35.128
68                                 QNB Group\n                   33.560
69                     Bank Rakyat Indonesia\n                   33.081

[70 rows x 2 columns]

In [10]:
data.head()

                                         Name Market Cap (US$ Billion)
0                            JPMorgan Chase\n                  488.470
1                           Bank of America\n                  379.250
2   Industrial and Commercial Bank of China\n                  246.500
3                               Wells Fargo\n                  308.013
4                   China Construction Bank\n                  257.399

### Loading the Data

In [12]:
data.to_json("bank_market_cap.json")

# API

## Extract Data Using an API

Using ExchangeRate-API we will extract currency exchange rate data. Use the below steps to get the access key and to get the data.

1.  Open the url : [https://exchangeratesapi.io/](https://exchangeratesapi.io/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkPY0221ENSkillsNetwork23455645-2021-01-01) and create a free account.
2.  Once the account is created. You will get the Get the Free API key option on the top as shown below:

<img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0221EN-SkillsNetwork/labs/module%206/Final%20Assignment/Images/getapi.png"/>

3.  Copy the API key and use in the url in Question 1.

### Call the API

In [14]:
url = "http://api.exchangeratesapi.io/v1/latest?base=EUR&access_key=a74582f972888ce6c8ac9eda18ba5d33"

In [17]:
r=requests.get(url)

In [18]:
print("request body:", r.request.body) # None
header=r.headers
print(r.headers)

request body: None
{'Date': 'Sat, 04 Dec 2021 17:19:10 GMT', 'Content-Type': 'application/json; Charset=UTF-8', 'Transfer-Encoding': 'chunked', 'Connection': 'keep-alive', 'x-apilayer-transaction-id': 'c16ac785-99ff-40c1-8fd7-5975ae3bdc84', 'access-control-allow-methods': 'GET, HEAD, POST, PUT, PATCH, DELETE, OPTIONS', 'access-control-allow-origin': '*', 'x-request-time': '0.014', 'CF-Cache-Status': 'DYNAMIC', 'Report-To': '{"endpoints":[{"url":"https:\\/\\/a.nel.cloudflare.com\\/report\\/v3?s=85GqLOKfDywEBWeLm34ngkEZYo7INwG2c%2BAp1jCzMPJy9p68%2FN1JnuA4XhAn3kn9JjEzBOK9r8Zj5wKjpMgyd80JYm4kDC0zN4hbLNuxUu5049LMW6Ngfiuf8ibt%2BI%2BGLWPl3JW5esmM"}],"group":"cf-nel","max_age":604800}', 'NEL': '{"success_fraction":0,"report_to":"cf-nel","max_age":604800}', 'Server': 'cloudflare', 'CF-RAY': '6b86b2b97e21405b-CDG', 'Content-Encoding': 'gzip'}

In [19]:
print(header['date'])
print(header['Content-Type'])
r.encoding

Sat, 04 Dec 2021 17:19:10 GMT
application/json; Charset=UTF-8

'UTF-8'

In [20]:
# json to python dict
d = r.json()

### Save as DataFrame

In [21]:
# Turn the data into a dataframe
df = pd.DataFrame(d)
df

     success   timestamp base        date         rates
AED     True  1638635343  EUR  2021-12-04      4.155546
AFN     True  1638635343  EUR  2021-12-04    108.635063
ALL     True  1638635343  EUR  2021-12-04    120.953369
AMD     True  1638635343  EUR  2021-12-04    554.613743
ANG     True  1638635343  EUR  2021-12-04      2.037820
..       ...         ...  ...         ...           ...
YER     True  1638635343  EUR  2021-12-04    283.119359
ZAR     True  1638635343  EUR  2021-12-04     18.256692
ZMK     True  1638635343  EUR  2021-12-04  10183.461688
ZMW     True  1638635343  EUR  2021-12-04     20.166127
ZWL     True  1638635343  EUR  2021-12-04    364.292450

[168 rows x 5 columns]

In [22]:
# Drop unnescessary columns
df.drop(df.columns[[0,1,2,3]], axis = 1, inplace = True)
df.head(5)

          rates
AED    4.155546
AFN  108.635063
ALL  120.953369
AMD  554.613743
ANG    2.037820

### Save it as csv

In [23]:
# Save the Dataframe
df.to_csv('exchange_rates_1.csv')

In [ ]:
S